micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dts.c
/**
  **********************************************************************************************************************
  * @file    stm32n6xx_hal_dts.c
  * @author  MCD Application Team
  * @brief   DTS HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the DTS peripheral:
  *           + Initialization and de-initialization functions.
  *           + Temperature measurement functions.
  *           + Alarms functions.
  *           + Sample counter functions.
  *           + Get extreme temperatures and handle state functions.
  *
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                                      ##### DTS Peripheral features #####
  ======================================================================================================================

  [..]
      The DTS hardware IP is a high-precision low-power junction temperature sensor (TS). It is composed of a
      configurable controller plus two embedded temperature sensors.
      In addition of temperature measurements, we have following features for each temperature sensor:

      (+) Two programmable alarms incorporating hysteresis.
      (+) Recording of the minimum and maximum temperatures measured.

      A sample counter is also available.

  ======================================================================================================================
                                      ##### How to use this driver #####
  ======================================================================================================================
  [..]
    *** Initialization and de-initialization ***
    ============================================
    [..]
      (#) User has first to initialize DTS instance.
      (#) As prerequisite, fill in the HAL_DTS_MspInit():
        (++) Enable DTS clock interface with __HAL_RCC_DTS_CLK_ENABLE().
        (++) If interrupt mode is used, enable and configure DTS interrupt with HAL_NVIC_SetPriority()
             and HAL_NVIC_EnableIRQ().
      (#) Call HAL_DTS_Init() function.

    [..]
      (#) User can de-initialize DTS instance with HAL_DTS_DeInit() function.

    *** Temperature measurement ***
    ===============================
    [..]
      (#) Configure senors using HAL_DTS_ConfigSensor() for each sensor.
      (#) In polling mode:
            (++) Use HAL_DTS_Start() to start temperature measurement.
            (++) Use HAL_DTS_PollForTemperature() to detect the end of measurement.
                 Use HAL_DTS_GetTemperature to get measured temperature.
      (#) In interrupt mode:
            (++) Use HAL_DTS_Start_IT() to start temperature measurement.
            (++) HAL_DTS_TemperatureCallback() will be called at the end of measurement.
                 Use HAL_DTS_GetTemperature to get measured temperature.
      (#) Use HAL_DTS_GetExtremeTemperatures() to get the extreme measured temperatures.
      (#) Stop measurement using HAL_DTS_Stop() or HAL_DTS_Stop_IT().
      (#) Configure sample counter using HAL_DTS_ConfigSampleCounter().
      (#) Get sample counter value using HAL_DTS_GetSampleCounter().
      (#) Activate sample discard using HAL_DTS_ConfigSampleDiscard().

    *** Alarms usage ***
    ====================
    [..]
      (#) Configure alarms using HAL_DTS_ConfigAlarmX() for each sensor (X is A or B).
      (#] HAL_DTS_AlarmXCallback() will be called when alarm X occurs (X is A or B).
      (#) Disable alarms using HAL_DTS_ConfigAlarmX() (X is A or B).

    *** generic functions ***
    =========================
    [..]
      (#) HAL_DTS_IRQHandler will be called when DTS interrupt occurs.
      (#) HAL_DTS_ErrorCallback will be called when DTS error occurs.
      (#) Use HAL_DTS_GetState() to get the current DTS instance state.

    *** Callback registration ***
    =============================
    [..]
      The compilation define USE_HAL_DTS_REGISTER_CALLBACKS when set to 1
      allows the user to configure dynamically the driver callbacks.
      Use functions HAL_DTS_RegisterCallback() to register a user callback.

    [..]
      Functions HAL_DTS_RegisterCallback() and HAL_DTS_UnRegisterCallback allow to register
      and unregister following callbacks:
        (+) MspInitCallback     : MSP init callback.
        (+) MspDeInitCallback   : MSP de-init callback.

    [..]
      For temperature measurement complete callback use dedicated register
      and unregister callback functions:
        (+) HAL_DTS_RegisterTemperatureCallback().
        (+) HAL_DTS_UnRegisterTemperatureCallback().

    [..]
      For alarms callback use dedicated register and unregister callback functions:
        (+) HAL_DTS_RegisterAlarmACallback().
        (+) HAL_DTS_RegisterAlarmBCallback().
        (+) HAL_DTS_UnRegisterAlarmACallback().
        (+) HAL_DTS_UnRegisterAlarmBCallback().

    [..]
      For error callback use dedicated register and unregister callback functions:
        (+) HAL_DTS_RegisterErrorCallback().
        (+) HAL_DTS_UnRegisterErrorCallback().

    [..]
      By default, after the call of init function and if the state is RESET
      all callbacks are reset to the corresponding legacy weak functions.
      Exception done for MspInit and MspDeInit callbacks that are respectively
      reset to the legacy weak functions in the init and de-init only when these
      callbacks are null (not registered beforehand).
      If not, MspInit or MspDeInit are not null, the init and de-init keep and use
      the user MspInit/MspDeInit callbacks (registered beforehand).

