micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dts.c
    [..]
      Callbacks can be registered/unregistered in READY state only.
      Exception done for MspInit/MspDeInit callbacks that can be registered/unregistered
      in READY or RESET state, thus registered (user) MspInit/DeInit callbacks can be used
      during the init/de-init.
      In that case first register the MspInit/MspDeInit user callbacks using
      HAL_DTS_RegisterCallback() before calling init or de-init function.

    [..]
      When the compilation define USE_HAL_DTS_REGISTER_CALLBACKS is set to 0 or
      not defined, the callback registering feature is not available
      and weak callbacks are used.

  @endverbatim
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

#ifdef HAL_DTS_MODULE_ENABLED

/** @defgroup DTS DTS
  * @brief DTS HAL module driver
  * @{
  */

/* Private typedef ---------------------------------------------------------------------------------------------------*/

/** @defgroup DTS_Private_Types  DTS Private Types
  * @{
  */
/**
  * @brief  DTS SDA registers
  */
typedef enum
{
  DTS_SDATS_CR_REG     = 0x00000000U, /*!< SDA TS control register */
  DTS_SDATS_CFGR_REG   = 0x01000000U, /*!< SDA TS configuration register */
  DTS_SDATS_TIMERR_REG = 0x05000000U, /*!< SDA TS timer register */
} DTS_SdaRegisterTypeDef;
/**
  * @}
  */

/* Private define ----------------------------------------------------------------------------------------------------*/

/** @defgroup DTS_Private_Define  DTS Private Define
  * @{
  */
#define DTS_SENSOR_ALL            2U          /* DTS sensor 0 and sensor 1 */
#define DTS_MAXIMUM_TIMEOUT       1000U       /* DTS maximum timeout of 1 second */
#define DTS_SDA_SENSOR_POWER_DOWN 0x00000001U /* Value to set on SDATS_CR register to power down sensor */
#define DTS_SDA_POWER_UP_DELAY    256U        /* Value to set on SDATS_TIMERR register for power-up typical delay */
#define DTS_CAL5_PARAM            4094.0f     /* Cal5 parameter used for temperature ccomputation */
#define DTS_J_PARAM               -0.1f       /* J parameter used for temperature ccomputation */
#define DTS_H_PARAM               200.0f      /* H parameter used for temperature ccomputation */
#define DTS_G_PARAM               60.0f       /* G parameter used for temperature ccomputation */
/**
  * @}
  */

/* Private macro -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/

/** @defgroup DTS_Private_Functions  DTS Private Functions
  * @{
  */
static HAL_StatusTypeDef DTS_ProgramSdaRegister(DTS_HandleTypeDef *hdts, uint32_t Sensor,
                                                DTS_SdaRegisterTypeDef Reg, uint32_t Value);
static float_t           DTS_ConvertToCelsiusDegree(uint32_t sample);
static uint32_t          DTS_ConvertFromCelsiusDegree(float_t temperature);
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/

/** @defgroup DTS_Exported_Functions  DTS Exported Functions
  * @{
  */

/** @defgroup DTS_Exported_Functions_Group1  Initialization and de-initialization functions
  * @brief    Initialization and de-initialization functions
  *
@verbatim
  ==============================================================================
            ##### Initialization and de-initialization functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Initialize the DTS instance.
      (+) De-initialize the DTS instance.
      (+) Register and unregister callbacks.
@endverbatim
  * @{
  */

/**
  * @brief  Initialize the DTS instance and configure DTS system clock.
  * @param  hdts DTS handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_Init(DTS_HandleTypeDef *hdts)
{
  HAL_StatusTypeDef status;

  /* Check DTS handle */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check that instance has not been already initialized */
    if (hdts->State != HAL_DTS_STATE_RESET)
    {
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
    else
    {
#if (USE_HAL_DTS_REGISTER_CALLBACKS == 1)
      /* Reset callback pointers to the weak predefined callbacks */
      hdts->TemperatureCallback = HAL_DTS_TemperatureCallback;
      hdts->AlarmACallback      = HAL_DTS_AlarmACallback;
      hdts->AlarmBCallback      = HAL_DTS_AlarmBCallback;
      hdts->ErrorCallback       = HAL_DTS_ErrorCallback;

      /* Call DTS MSP init function */
      if (hdts->MspInitCallback == NULL)
      {
        hdts->MspInitCallback = HAL_DTS_MspInit;
      }
      hdts->MspInitCallback(hdts);
#else /* USE_HAL_DTS_REGISTER_CALLBACKS */
      /* Call DTS MSP init function */
      HAL_DTS_MspInit(hdts);
#endif /* USE_HAL_DTS_REGISTER_CALLBACKS */

      /* Configure DTS TS clock to TS operating frequency range (4MHz to 8MHz). */
      /* DTS kernel clock (hsi_div8_ck clock) is divided by (CLK_SYNTH_HI + 1) + (CLK_SYNTH_LO + 1). */
      /* Because HSI frequency is 64MHz, hsi_div8_ck frequency is 8MHz. */
      /* So CLK_SYNTH_HI and CLK_SYNTH_LO have to be set to 0 on TSCCLKSYNTHR register */
      /* in order to have TS clock frequency at 4MHz. */
      hdts->Instance->TSCCLKSYNTHR = (DTS_TSCCLKSYNTHR_CLK_SYNTH_EN |
                                      (1U << DTS_TSCCLKSYNTHR_CLK_SYNTH_HOLD_Pos));

      /* Program typical power-up delay for all sensors */
      status = DTS_ProgramSdaRegister(hdts, DTS_SENSOR_ALL, DTS_SDATS_TIMERR_REG, DTS_SDA_POWER_UP_DELAY);

      if (status == HAL_OK)
      {
        /* Enable TS interrupt */
        hdts->Instance->PVT_IER = DTS_PVT_IER_TS_IRQ_ENABLE;

