micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dts.c
        /* Reset sensor modes and error code and update state */
        hdts->SensorMode[0U] = DTS_SENSOR_MODE_DISABLE;
        hdts->SensorMode[1U] = DTS_SENSOR_MODE_DISABLE;
        hdts->ErrorCode      = HAL_DTS_ERROR_NONE;
        /* Update state */
        hdts->State = HAL_DTS_STATE_READY;
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  De-initialize the DTS instance.
  * @param  hdts DTS handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_DeInit(DTS_HandleTypeDef *hdts)
{
  HAL_StatusTypeDef status;

  /* Check DTS handle */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check that instance has not been already deinitialized */
    if (hdts->State == HAL_DTS_STATE_RESET)
    {
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
    else
    {
      /* Power down temperature sensors */
      status = DTS_ProgramSdaRegister(hdts, DTS_SENSOR_ALL, DTS_SDATS_CR_REG, DTS_SDA_SENSOR_POWER_DOWN);

      if (status == HAL_OK)
      {
        /* Disable all interrupts */
        DTS_Sensor0->TS_IER = 0U;
        DTS_Sensor1->TS_IER = 0U;

        /* Clear all pendings flags */
        DTS_Sensor0->TS_ICR = (DTS_TS_ICR_IRQ_CLEAR_FAULT  | DTS_TS_ICR_IRQ_CLEAR_DONE |
                               DTS_TS_ICR_IRQ_CLEAR_ALARMA | DTS_TS_ICR_IRQ_CLEAR_ALARMB);
        DTS_Sensor1->TS_ICR = (DTS_TS_ICR_IRQ_CLEAR_FAULT  | DTS_TS_ICR_IRQ_CLEAR_DONE |
                               DTS_TS_ICR_IRQ_CLEAR_ALARMA | DTS_TS_ICR_IRQ_CLEAR_ALARMB);

        /* Disable TS interrupt */
        hdts->Instance->PVT_IER = 0U;

        /* Disable DTS system clock */
        hdts->Instance->TSCCLKSYNTHR &= ~(DTS_TSCCLKSYNTHR_CLK_SYNTH_EN);

        /* Call DTS MSP deinit function */
#if (USE_HAL_DTS_REGISTER_CALLBACKS == 1)
        if (hdts->MspDeInitCallback == NULL)
        {
          hdts->MspDeInitCallback = HAL_DTS_MspDeInit;
        }
        hdts->MspDeInitCallback(hdts);
#else /* USE_HAL_DTS_REGISTER_CALLBACKS */
        HAL_DTS_MspDeInit(hdts);
#endif /* USE_HAL_DTS_REGISTER_CALLBACKS */

        /*Update state */
        hdts->State = HAL_DTS_STATE_RESET;
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Initialize the DTS instance MSP.
  * @param  hdts DTS handle.
  * @retval None.
  */
__weak void HAL_DTS_MspInit(DTS_HandleTypeDef *hdts)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdts);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_DTS_MspInit could be implemented in the user file */
}

/**
  * @brief  De-initialize the DTS instance MSP.
  * @param  hdts DTS handle.
  * @retval None.
  */
__weak void HAL_DTS_MspDeInit(DTS_HandleTypeDef *hdts)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdts);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_DTS_MspDeInit could be implemented in the user file */
}

#if (USE_HAL_DTS_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a user DTS callback to be used instead of the weak predefined callback.
  * @param  hdts DTS handle.
  * @param  CallbackID ID of the callback to be registered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_DTS_MSPINIT_CB_ID MSP init callback ID.
  *           @arg @ref HAL_DTS_MSPDEINIT_CB_ID MSP de-init callback ID.
  * @param  pCallback pointer to the callback function.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_RegisterCallback(DTS_HandleTypeDef        *hdts,
                                           HAL_DTS_CallbackIDTypeDef CallbackID,
                                           pDTS_CallbackTypeDef      pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else if (pCallback == NULL)
  {
    hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_PARAM;
    status = HAL_ERROR;
  }
  else
  {
    const HAL_DTS_StateTypeDef temp_state = hdts->State;

    if ((temp_state == HAL_DTS_STATE_READY) || (temp_state == HAL_DTS_STATE_RESET))
    {
      switch (CallbackID)
      {
        case HAL_DTS_MSPINIT_CB_ID :
          hdts->MspInitCallback = pCallback;
          break;
        case HAL_DTS_MSPDEINIT_CB_ID :
          hdts->MspDeInitCallback = pCallback;
          break;
        default :
          hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else
    {
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Unregister a user DTS callback.
  *         DTS callback is redirected to the weak predefined callback.
  * @param  hdts DTS handle.
  * @param  CallbackID ID of the callback to be unregistered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_DTS_MSPINIT_CB_ID MSP init callback ID.
  *           @arg @ref HAL_DTS_MSPDEINIT_CB_ID MSP de-init callback ID.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_UnRegisterCallback(DTS_HandleTypeDef        *hdts,
                                             HAL_DTS_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    const HAL_DTS_StateTypeDef temp_state = hdts->State;

    if ((temp_state == HAL_DTS_STATE_READY) || (temp_state == HAL_DTS_STATE_RESET))
    {
      switch (CallbackID)
      {
        case HAL_DTS_MSPINIT_CB_ID :
          hdts->MspInitCallback = HAL_DTS_MspInit;
          break;
        case HAL_DTS_MSPDEINIT_CB_ID :
          hdts->MspDeInitCallback = HAL_DTS_MspDeInit;
          break;
        default :
          hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else
    {
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Register a user DTS sensor callback to be used instead of the weak predefined callback.
  * @param  hdts DTS handle.
  * @param  CallbackID ID of the sensor callback to be registered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_DTS_SENSOR_TEMPERATURE_CB_ID Sensor temperature callback ID.
  *           @arg @ref HAL_DTS_SENSOR_ALARMA_CB_ID Sensor alarm A callback ID.
  *           @arg @ref HAL_DTS_SENSOR_ALARMB_CB_ID Sensor alarm B callback ID.
  *           @arg @ref HAL_DTS_SENSOR_ERROR_CB_ID Sensor error callback ID.
  * @param  pCallback pointer to the sensor callback function.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_RegisterSensorCallback(DTS_HandleTypeDef              *hdts,
                                                 HAL_DTS_SensorCallbackIDTypeDef CallbackID,
                                                 pDTS_SensorCallbackTypeDef      pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else if (pCallback == NULL)
  {
    hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_PARAM;
    status = HAL_ERROR;
  }
  else
  {
    if (hdts->State == HAL_DTS_STATE_READY)
    {
      switch (CallbackID)
      {
        case HAL_DTS_SENSOR_TEMPERATURE_CB_ID :
          hdts->TemperatureCallback = pCallback;
          break;
        case HAL_DTS_SENSOR_ALARMA_CB_ID :
          hdts->AlarmACallback = pCallback;
          break;
        case HAL_DTS_SENSOR_ALARMB_CB_ID :
          hdts->AlarmBCallback = pCallback;
          break;
        case HAL_DTS_SENSOR_ERROR_CB_ID :
          hdts->ErrorCallback = pCallback;
          break;
        default :
          hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else
    {
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Unregister a user DTS sensor callback.
  *         DTS sensor callback is redirected to the weak predefined callback.
  * @param  hdts DTS handle.
  * @param  CallbackID ID of the sensor callback to be unregistered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_DTS_SENSOR_TEMPERATURE_CB_ID Sensor temperature callback ID.
  *           @arg @ref HAL_DTS_SENSOR_ALARMA_CB_ID Sensor alarm A callback ID.
  *           @arg @ref HAL_DTS_SENSOR_ALARMB_CB_ID Sensor alarm B callback ID.
  *           @arg @ref HAL_DTS_SENSOR_ERROR_CB_ID Sensor error callback ID.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_UnRegisterSensorCallback(DTS_HandleTypeDef              *hdts,
                                                   HAL_DTS_SensorCallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    if (hdts->State == HAL_DTS_STATE_READY)
    {
      switch (CallbackID)
      {
        case HAL_DTS_SENSOR_TEMPERATURE_CB_ID :
          hdts->TemperatureCallback = HAL_DTS_TemperatureCallback;
          break;
        case HAL_DTS_SENSOR_ALARMA_CB_ID :
          hdts->AlarmACallback = HAL_DTS_AlarmACallback;
          break;
        case HAL_DTS_SENSOR_ALARMB_CB_ID :
          hdts->AlarmBCallback = HAL_DTS_AlarmBCallback;
          break;
        case HAL_DTS_SENSOR_ERROR_CB_ID :
          hdts->ErrorCallback = HAL_DTS_ErrorCallback;
          break;
        default :
          hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_CALLBACK;
          status = HAL_ERROR;
          break;
      }
    }
    else
    {
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}
#endif /* USE_HAL_DTS_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup DTS_Exported_Functions_Group2  Temperature measurement functions
  * @brief    Temperature measuremen functions
  *
@verbatim
  ==============================================================================
                    ##### Temperature measurement functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) configure sensor.
      (+) Start and stop temperature measurement in polling or interrupt mode.
      (+) Wait and get temperature values.
      (+) Get extreme temperature values.
      (+) Configure and get sample counter.
      (+) Configure sample discard.
@endverbatim
  * @{
  */

/**
  * @brief  Configure a sensor.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor to configure.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @param  pSensorParams Sensor parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_ConfigSensor(DTS_HandleTypeDef       *hdts,
                                       HAL_DTS_Sensor           Sensor,
                                       DTS_SensorConfigTypeDef *pSensorParams)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else if (pSensorParams == NULL)
  {
    hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_PARAM;
    status = HAL_ERROR;
  }
  else
  {
    const HAL_DTS_StateTypeDef temp_state = hdts->State;

    /* Check parameters */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));
    assert_param(IS_DTS_SENSOR_MODE(pSensorParams->Mode));

    /* Check current state */
    if ((temp_state == HAL_DTS_STATE_READY) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_1) && (Sensor == DTS_SENSOR_0)) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_0) && (Sensor == DTS_SENSOR_1)))
    {
      if (pSensorParams->Mode != DTS_SENSOR_MODE_DISABLE)
      {
        /* Check resolution parameter */
        assert_param(IS_DTS_SENSOR_RESOLUTION(pSensorParams->Resolution));

