micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dts.c
        /* Program sensor trigger and resolution */
        if (pSensorParams->Mode == DTS_SENSOR_MODE_TRIGGER)
        {
          /* Check sensor trigger parameter */
          assert_param(IS_DTS_SENSOR_TRIGGER(pSensorParams->Trigger));
          status = DTS_ProgramSdaRegister(hdts, (uint32_t) Sensor, DTS_SDATS_CFGR_REG,
                                          (pSensorParams->Trigger | pSensorParams->Resolution));
        }
        else
        {
          status = DTS_ProgramSdaRegister(hdts, (uint32_t) Sensor, DTS_SDATS_CFGR_REG, pSensorParams->Resolution);
        }

        if (status == HAL_OK)
        {
          /* Remove potential sensor disabling in TSCSDIFDISABLER register */
          hdts->Instance->TSCSDIFDISABLER &= (Sensor == DTS_SENSOR_0) ? ~(DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE) :
                                             ~(DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE);

          /* Update sensor mode */
          hdts->SensorMode[Sensor] = pSensorParams->Mode;
        }
      }
      else
      {
        /* Disable sensor */
        hdts->Instance->TSCSDIFDISABLER |= (Sensor == DTS_SENSOR_0) ? DTS_TSCSDIFDISABLER_TS0_SDIF_DISABLE :
                                           DTS_TSCSDIFDISABLER_TS1_SDIF_DISABLE;

        /* Update sensor mode */
        hdts->SensorMode[Sensor] = DTS_SENSOR_MODE_DISABLE;
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Start temperature measurement on one sensor in polling mode.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_Start(DTS_HandleTypeDef *hdts,
                                HAL_DTS_Sensor     Sensor)
{
  HAL_StatusTypeDef status;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    const HAL_DTS_StateTypeDef temp_state = hdts->State;

    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check current state */
    if ((temp_state == HAL_DTS_STATE_READY) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_1) && (Sensor == DTS_SENSOR_0)) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_0) && (Sensor == DTS_SENSOR_1)))
    {
      /* Check sensor mode */
      if (hdts->SensorMode[Sensor] == DTS_SENSOR_MODE_DISABLE)
      {
        hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_SENSOR_MODE;
        status = HAL_ERROR;
      }
      else
      {
        DTS_SensorTypeDef *psensor;

        psensor = (Sensor == DTS_SENSOR_0) ? DTS_Sensor0 : DTS_Sensor1;

        /* Reset min and max measured values for this sensor */
        psensor->TSHILORESETR = (DTS_TSHILORESETR_SMPL_LO_SET | DTS_TSHILORESETR_SMPL_HI_CLR);

        /* Start sensor with associated mode */
        status = DTS_ProgramSdaRegister(hdts, (uint32_t) Sensor, DTS_SDATS_CR_REG, hdts->SensorMode[Sensor]);

        if (status == HAL_OK)
        {
          /* Update state */
          if (hdts->State == HAL_DTS_STATE_READY)
          {
            hdts->State = (Sensor == DTS_SENSOR_0) ? HAL_DTS_STATE_RUNNING_0 : HAL_DTS_STATE_RUNNING_1;
          }
          else
          {
            hdts->State = HAL_DTS_STATE_RUNNING_BOTH;
          }
        }
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Poll for available temperature measurement on one sensor.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @param  Timeout Timeout value in milliseconds.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_PollForTemperature(DTS_HandleTypeDef *hdts,
                                             HAL_DTS_Sensor     Sensor,
                                             uint32_t           Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    const HAL_DTS_StateTypeDef temp_state = hdts->State;

    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check current state */
    if ((temp_state == HAL_DTS_STATE_RUNNING_BOTH) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_0) && (Sensor == DTS_SENSOR_0)) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_1) && (Sensor == DTS_SENSOR_1)))
    {
      uint32_t tickstart = HAL_GetTick();
      const DTS_SensorTypeDef *psensor;

      psensor = (Sensor == DTS_SENSOR_0) ? DTS_Sensor0 : DTS_Sensor1;

      /* Wait for available temperature measurement */
      while (((psensor->TSSDIFDONER & DTS_TSSDIFDONER_SDIF_SMPL_DONE) != DTS_TSSDIFDONER_SDIF_SMPL_DONE) &&
             (status == HAL_OK))
      {
        /* Check the timeout */
        if (Timeout != HAL_MAX_DELAY)
        {
          if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
          {
            status = HAL_TIMEOUT;
          }
        }
      }

      if (status == HAL_OK)
      {
        /* Update state */
        if (hdts->SensorMode[Sensor] == DTS_SENSOR_MODE_SINGLE)
        {
          if (hdts->State == HAL_DTS_STATE_RUNNING_BOTH)
          {
            hdts->State = (Sensor == DTS_SENSOR_0) ? HAL_DTS_STATE_RUNNING_1 : HAL_DTS_STATE_RUNNING_0;
          }
          else
          {
            hdts->State = HAL_DTS_STATE_READY;
          }
        }
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Get temperature measurement on one sensor.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @param  pTemperature Pointer to temperature in celsius degree.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_GetTemperature(DTS_HandleTypeDef *hdts,
                                         HAL_DTS_Sensor     Sensor,
                                         float_t           *pTemperature)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else if (pTemperature == NULL)
  {
    hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_PARAM;
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check current state */
    if (hdts->State != HAL_DTS_STATE_RESET)
    {
      const DTS_SensorTypeDef *psensor;
      uint32_t sample;

