micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dts.c
      psensor = (Sensor == DTS_SENSOR_0) ? DTS_Sensor0 : DTS_Sensor1;

      /* Get sample */
      sample = psensor->TSSDIFDATAR;

      /* Check if sample is valid */
      if ((sample & (DTS_TSSDIFDATAR_SAMPLE_TYPE | DTS_TSSDIFDATAR_SAMPLE_FAULT)) == 0U)
      {
        /* Convert sample in celsius degree */
        *pTemperature = DTS_ConvertToCelsiusDegree((sample & DTS_TSSDIFDATAR_SAMPLE_DATA_Msk));
      }
      else
      {
        /* Invalid sample or fault*/
        if ((sample & DTS_TSSDIFDATAR_SAMPLE_TYPE) != 0U)
        {
          hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_SAMPLE;
        }
        else
        {
          hdts->ErrorCode |= HAL_DTS_ERROR_FAULT;
        }
        status = HAL_ERROR;
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Stop temperature measurement on one sensor in polling mode.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_Stop(DTS_HandleTypeDef *hdts,
                               HAL_DTS_Sensor     Sensor)
{
  HAL_StatusTypeDef status;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    const HAL_DTS_StateTypeDef temp_state = hdts->State;

    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check current state */
    if ((temp_state == HAL_DTS_STATE_RUNNING_BOTH) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_0) && (Sensor == DTS_SENSOR_0)) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_1) && (Sensor == DTS_SENSOR_1)))
    {
      /* Power down sensor */
      status = DTS_ProgramSdaRegister(hdts, (uint32_t) Sensor, DTS_SDATS_CR_REG, DTS_SDA_SENSOR_POWER_DOWN);

      if (status == HAL_OK)
      {
        /* Update state */
        if (hdts->State == HAL_DTS_STATE_RUNNING_BOTH)
        {
          hdts->State = (Sensor == DTS_SENSOR_0) ? HAL_DTS_STATE_RUNNING_1 : HAL_DTS_STATE_RUNNING_0;
        }
        else
        {
          hdts->State = HAL_DTS_STATE_READY;
        }
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Start temperature measurement on one sensor in interrupt mode.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_Start_IT(DTS_HandleTypeDef *hdts,
                                   HAL_DTS_Sensor     Sensor)
{
  HAL_StatusTypeDef status;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    const HAL_DTS_StateTypeDef temp_state = hdts->State;

    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check current state */
    if ((temp_state == HAL_DTS_STATE_READY) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_1) && (Sensor == DTS_SENSOR_0)) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_0) && (Sensor == DTS_SENSOR_1)))
    {
      /* Check sensor mode */
      if (hdts->SensorMode[Sensor] == DTS_SENSOR_MODE_DISABLE)
      {
        hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_SENSOR_MODE;
        status = HAL_ERROR;
      }
      else
      {
        DTS_SensorTypeDef *psensor;

        psensor = (Sensor == DTS_SENSOR_0) ? DTS_Sensor0 : DTS_Sensor1;

        /* Enable sample done and fault interrupts */
        psensor->TS_IER |= (DTS_TS_IER_IRQ_EN_FAULT | DTS_TS_IER_IRQ_EN_DONE);

        /* Reset min and max measured values for this sensor */
        psensor->TSHILORESETR = (DTS_TSHILORESETR_SMPL_LO_SET | DTS_TSHILORESETR_SMPL_HI_CLR);

        /* Start sensor with associated mode */
        status = DTS_ProgramSdaRegister(hdts, (uint32_t) Sensor, DTS_SDATS_CR_REG, hdts->SensorMode[Sensor]);

        if (status == HAL_OK)
        {
          /* Update state */
          if (hdts->State == HAL_DTS_STATE_READY)
          {
            hdts->State = (Sensor == DTS_SENSOR_0) ? HAL_DTS_STATE_RUNNING_0 : HAL_DTS_STATE_RUNNING_1;
          }
          else
          {
            hdts->State = HAL_DTS_STATE_RUNNING_BOTH;
          }
        }
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Stop temperature measurement on one sensor in interrupt mode.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_Stop_IT(DTS_HandleTypeDef *hdts,
                                  HAL_DTS_Sensor     Sensor)
{
  HAL_StatusTypeDef status;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    const HAL_DTS_StateTypeDef temp_state = hdts->State;

    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check current state */
    if ((temp_state == HAL_DTS_STATE_RUNNING_BOTH) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_0) && (Sensor == DTS_SENSOR_0)) ||
        ((temp_state == HAL_DTS_STATE_RUNNING_1) && (Sensor == DTS_SENSOR_1)))
    {
      DTS_SensorTypeDef *psensor;

      psensor = (Sensor == DTS_SENSOR_0) ? DTS_Sensor0 : DTS_Sensor1;

      /* Power down sensor */
      status = DTS_ProgramSdaRegister(hdts, (uint32_t) Sensor, DTS_SDATS_CR_REG, DTS_SDA_SENSOR_POWER_DOWN);

      if (status == HAL_OK)
      {
        /* Disable sample done and fault interrupts */
        psensor->TS_IER &= ~(DTS_TS_IER_IRQ_EN_FAULT | DTS_TS_IER_IRQ_EN_DONE);

        /* Clear potential sample done and fault interrupt flags */
        psensor->TS_ICR |= (DTS_TS_ICR_IRQ_CLEAR_FAULT | DTS_TS_ICR_IRQ_CLEAR_DONE);

        /* Update state */
        if (hdts->State == HAL_DTS_STATE_RUNNING_BOTH)
        {
          hdts->State = (Sensor == DTS_SENSOR_0) ? HAL_DTS_STATE_RUNNING_1 : HAL_DTS_STATE_RUNNING_0;
        }
        else
        {
          hdts->State = HAL_DTS_STATE_READY;
        }
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  DTS temperature callback.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @retval None.
  */
__weak void HAL_DTS_TemperatureCallback(DTS_HandleTypeDef *hdts,
                                        HAL_DTS_Sensor     Sensor)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdts);
  UNUSED(Sensor);

