micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dts.c
  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_DTS_TemperatureCallback could be implemented in the user file */
}

/**
  * @brief  Get extreme temperatures on one sensor.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @param  pMin Pointer to minimum temperature in celsius degree.
  * @param  pMax Pointer to maximum temperature in celsius degree.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_GetExtremeTemperatures(DTS_HandleTypeDef *hdts,
                                                 HAL_DTS_Sensor     Sensor,
                                                 float_t           *pMin,
                                                 float_t           *pMax)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else if ((pMin == NULL) || (pMax == NULL))
  {
    hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_PARAM;
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check current state */
    if (hdts->State != HAL_DTS_STATE_RESET)
    {
      const DTS_SensorTypeDef *psensor;
      uint32_t sample;

      psensor = (Sensor == DTS_SENSOR_0) ? DTS_Sensor0 : DTS_Sensor1;

      /* Get min and max samples then convert it */
      sample = psensor->TSHLSAMPLER;
      *pMin = DTS_ConvertToCelsiusDegree((sample & DTS_TSHLSAMPLER_SMPL_LO_Msk));
      *pMax = DTS_ConvertToCelsiusDegree((sample & DTS_TSHLSAMPLER_SMPL_HI_Msk) >> DTS_TSHLSAMPLER_SMPL_HI_Pos);
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Configure sample counter.
  * @param  hdts DTS handle.
  * @param  Enable Enable sample counter.
  * @param  Clear Clear sample counter.
  * @param  Hold Set sample counter on hold.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_ConfigSampleCounter(DTS_HandleTypeDef *hdts,
                                              FunctionalState    Enable,
                                              FunctionalState    Clear,
                                              FunctionalState    Hold)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameter */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check current state */
    if (hdts->State != HAL_DTS_STATE_RESET)
    {
      /* Enable or disable sample counter */
      if (Enable == ENABLE)
      {
        hdts->Instance->TSCSMPL_CR &= ~(DTS_TSCSMPL_CR_SMPL_CTR_DISABLE);
      }
      else
      {
        hdts->Instance->TSCSMPL_CR |= DTS_TSCSMPL_CR_SMPL_CTR_DISABLE;
      }

      /* Clear sample counter */
      if (Clear == ENABLE)
      {
        hdts->Instance->TSCSDIFSMPLCLRR |= DTS_TSCSDIFSMPLCLRR_SMPL_CNTER_CLEAR;
      }

      /* Configure hold status for sample counter */
      if (Hold == ENABLE)
      {
        hdts->Instance->TSCSMPL_CR |= DTS_TSCSMPL_CR_SMPL_CTR_HOLD;
      }
      else
      {
        hdts->Instance->TSCSMPL_CR &= ~(DTS_TSCSMPL_CR_SMPL_CTR_HOLD);
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Get sample counter value.
  * @param  hdts DTS handle.
  * @param  pNumber Pointer to sample counter value.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_GetSampleCounterValue(DTS_HandleTypeDef *hdts,
                                                uint32_t          *pNumber)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else if (pNumber == NULL)
  {
    hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_PARAM;
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));

    /* Check current state */
    if (hdts->State != HAL_DTS_STATE_RESET)
    {
      /* Get sample counter value */
      *pNumber = hdts->Instance->TSCSMPLCNTR;
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Configure sample discard.
  * @param  hdts DTS handle.
  * @param  Status Enable or disable.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_ConfigSampleDiscard(DTS_HandleTypeDef *hdts,
                                              FunctionalState    Status)
{
  HAL_StatusTypeDef retVal = HAL_OK;

  /* Check parameter */
  if (hdts == NULL)
  {
    retVal = HAL_ERROR;
  }
  else
  {
    /* Check current state */
    if (hdts->State != HAL_DTS_STATE_RESET)
    {
      /* Configure sample discard */
      if (Status == ENABLE)
      {
        hdts->Instance->TSCSMPL_CR |= DTS_TSCSMPL_CR_SMPL_DISCARD;
      }
      else
      {
        hdts->Instance->TSCSMPL_CR &= ~(DTS_TSCSMPL_CR_SMPL_DISCARD);
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      retVal = HAL_ERROR;
    }
  }

  /* Return function status */
  return retVal;
}

/**
  * @}
  */

/** @defgroup DTS_Exported_Functions_Group3  Alarm functions
  * @brief    Alarm functions
  *
@verbatim
  ==============================================================================
                       ##### Alarms functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Configure alarms.
      (+) Manage alarm callbacks.
@endverbatim
  * @{
  */

/**
  * @brief  Configure alarmA for one sensor.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @param  pAlarmParams Pointer to alarm parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_ConfigAlarmA(DTS_HandleTypeDef            *hdts,
                                       HAL_DTS_Sensor                Sensor,
                                       const DTS_AlarmConfigTypeDef *pAlarmParams)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else if (pAlarmParams == NULL)
  {
    hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_PARAM;
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));
    assert_param(IS_FUNCTIONAL_STATE(pAlarmParams->Enable));

    /* Check current state */
    if (hdts->State == HAL_DTS_STATE_READY)
    {
      uint32_t alarmThreshold;
      uint32_t alarmHysteresis;
      DTS_SensorTypeDef *psensor;

