micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dts.c
      psensor = (Sensor == DTS_SENSOR_0) ? DTS_Sensor0 : DTS_Sensor1;

      /* Configure alarm A */
      if (pAlarmParams->Enable == ENABLE)
      {
        /* Check threshold and hysteresis parameters */
        assert_param(IS_DTS_ALARM_PARAM(pAlarmParams->Threshold));
        assert_param(IS_DTS_ALARM_PARAM(pAlarmParams->Hysteresis));

        /* Convert threshold and hysteresis from celsius degree  and store it on DTS register */
        alarmThreshold = DTS_ConvertFromCelsiusDegree(pAlarmParams->Threshold);
        alarmHysteresis = DTS_ConvertFromCelsiusDegree(pAlarmParams->Hysteresis);
        psensor->TSALARMA_CFGR = (alarmThreshold << DTS_TSALARMA_CFGR_ALARMA_THRESH_Pos) |
                                 (alarmHysteresis << DTS_TSALARMA_CFGR_HYSTA_THRESH_Pos);

        /* Enable alarm A interrupt */
        psensor->TS_IER |= DTS_TS_IER_IRQ_EN_ALARMA;
      }
      else
      {
        /* Disable alarm A interrupt */
        psensor->TS_IER &= ~(DTS_TS_IER_IRQ_EN_ALARMA);

        /* Clear potential alarm A pending flag */
        psensor->TS_ICR |= DTS_TS_ICR_IRQ_CLEAR_ALARMA;

        /* Disable alarm A */
        psensor->TSALARMA_CFGR = 0U;
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Configure alarmB for one sensor.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @param  pAlarmParams Pointer to alarm parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DTS_ConfigAlarmB(DTS_HandleTypeDef            *hdts,
                                       HAL_DTS_Sensor                Sensor,
                                       const DTS_AlarmConfigTypeDef *pAlarmParams)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (hdts == NULL)
  {
    status = HAL_ERROR;
  }
  else if (pAlarmParams == NULL)
  {
    hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_PARAM;
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameter */
    assert_param(IS_DTS_ALL_INSTANCE(hdts->Instance));
    assert_param(IS_FUNCTIONAL_STATE(pAlarmParams->Enable));

    /* Check current state */
    if (hdts->State == HAL_DTS_STATE_READY)
    {
      uint32_t alarmThreshold;
      uint32_t alarmHysteresis;
      DTS_SensorTypeDef *psensor;

      psensor = (Sensor == DTS_SENSOR_0) ? DTS_Sensor0 : DTS_Sensor1;

      /* Configure alarm B */
      if (pAlarmParams->Enable == ENABLE)
      {
        /* Check threshold and hysteresis parameters */
        assert_param(IS_DTS_ALARM_PARAM(pAlarmParams->Threshold));
        assert_param(IS_DTS_ALARM_PARAM(pAlarmParams->Hysteresis));

        /* Convert threshold and hysteresis from celsius degree and store it on DTS register */
        alarmThreshold = DTS_ConvertFromCelsiusDegree(pAlarmParams->Threshold);
        alarmHysteresis = DTS_ConvertFromCelsiusDegree(pAlarmParams->Hysteresis);
        psensor->TSALARMB_CFGR = (alarmThreshold << DTS_TSALARMB_CFGR_ALARMB_THRESH_Pos) |
                                 (alarmHysteresis << DTS_TSALARMB_CFGR_HYSTB_THRESH_Pos);

        /* Enable alarm B interrupt */
        psensor->TS_IER |= DTS_TS_IER_IRQ_EN_ALARMB;
      }
      else
      {
        /* Disable alarm B interrupt */
        psensor->TS_IER &= ~(DTS_TS_IER_IRQ_EN_ALARMB);

        /* Clear potential alarm B pending flag */
        psensor->TS_ICR |= DTS_TS_ICR_IRQ_CLEAR_ALARMB;

        /* Disable alarm A */
        psensor->TSALARMB_CFGR = 0U;
      }
    }
    else
    {
      /* function call in wrong state */
      hdts->ErrorCode |= HAL_DTS_ERROR_INVALID_STATE;
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  DTS alarm A callback.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @retval None.
  */
__weak void HAL_DTS_AlarmACallback(DTS_HandleTypeDef *hdts,
                                   HAL_DTS_Sensor     Sensor)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdts);
  UNUSED(Sensor);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_DTS_AlarmACallback could be implemented in the user file */
}

/**
  * @brief  DTS alarm B callback.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @retval None.
  */
__weak void HAL_DTS_AlarmBCallback(DTS_HandleTypeDef *hdts,
                                   HAL_DTS_Sensor     Sensor)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdts);
  UNUSED(Sensor);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_DTS_AlarmBCallback could be implemented in the user file */
}

/**
  * @}
  */

/** @defgroup DTS_Exported_Functions_Group4  Generic functions
  * @brief    Generic functions
  *
@verbatim
  ==============================================================================
                       ##### Generic functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Handle DTS interrupt.
      (+) Inform user that error occurs.
      (+) Get the current DTS instance state.
@endverbatim
  * @{
  */

/**
  * @brief  Handle DTS interrupts.
  * @param  hdts DTS handle.
  * @retval None.
  */
void HAL_DTS_IRQHandler(DTS_HandleTypeDef *hdts)
{
  DTS_SensorTypeDef *psensor;
  HAL_DTS_Sensor Sensor;
  uint32_t tmp_reg1;
  uint32_t tmp_reg2;
  uint32_t interrupts;

