micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_dts.c
  /* Check on which sensor interrupt occurs */
  if ((hdts->Instance->TS_ISR & DTS_TS_ISR_TS0_IRQ_STATUS) == DTS_TS_ISR_TS0_IRQ_STATUS)
  {
    psensor = DTS_Sensor0;
    Sensor = DTS_SENSOR_0;
  }
  else
  {
    psensor = DTS_Sensor1;
    Sensor = DTS_SENSOR_1;
  }

  /* Read current flags and interrupts on sensor */
  tmp_reg1 = psensor->TS_IER;
  tmp_reg2 = psensor->TS_ISR;
  interrupts = (tmp_reg1 & tmp_reg2);

  /* Check if sample done occurs */
  if ((interrupts & DTS_TS_ISR_IRQ_STATUS_DONE) == DTS_TS_ISR_IRQ_STATUS_DONE)
  {
    /* Clear corresponding flag */
    psensor->TS_ICR |= DTS_TS_ICR_IRQ_CLEAR_DONE;

    /* Call temperature callback */
#if (USE_HAL_DTS_REGISTER_CALLBACKS == 1)
    hdts->TemperatureCallback(hdts, Sensor);
#else /* USE_HAL_DTS_REGISTER_CALLBACKS */
    HAL_DTS_TemperatureCallback(hdts, Sensor);
#endif /* USE_HAL_DTS_REGISTER_CALLBACKS */

    /* Update state */
    if (hdts->SensorMode[Sensor] == DTS_SENSOR_MODE_SINGLE)
    {
      /* Disable sample done interrupt */
      psensor->TS_IER &= ~(DTS_TS_IER_IRQ_EN_DONE);

      if (hdts->State == HAL_DTS_STATE_RUNNING_BOTH)
      {
        hdts->State = (Sensor == DTS_SENSOR_0) ? HAL_DTS_STATE_RUNNING_1 : HAL_DTS_STATE_RUNNING_0;
      }
      else
      {
        hdts->State = HAL_DTS_STATE_READY;
      }
    }
  }
  /* Check if alarm A occurs */
  if ((interrupts & DTS_TS_ISR_IRQ_STATUS_ALARMA) == DTS_TS_ISR_IRQ_STATUS_ALARMA)
  {
    /* Clear corresponding flag */
    psensor->TS_ICR |= DTS_TS_ICR_IRQ_CLEAR_ALARMA;

    /* Call alarm A callback */
#if (USE_HAL_DTS_REGISTER_CALLBACKS == 1)
    hdts->AlarmACallback(hdts, Sensor);
#else /* USE_HAL_DTS_REGISTER_CALLBACKS */
    HAL_DTS_AlarmACallback(hdts, Sensor);
#endif /* USE_HAL_DTS_REGISTER_CALLBACKS */
  }
  /* Check if alarm B occurs */
  if ((interrupts & DTS_TS_ISR_IRQ_STATUS_ALARMB) == DTS_TS_ISR_IRQ_STATUS_ALARMB)
  {
    /* Clear corresponding flag */
    psensor->TS_ICR |= DTS_TS_ICR_IRQ_CLEAR_ALARMB;

    /* Call alarm B callback */
#if (USE_HAL_DTS_REGISTER_CALLBACKS == 1)
    hdts->AlarmBCallback(hdts, Sensor);
#else /* USE_HAL_DTS_REGISTER_CALLBACKS */
    HAL_DTS_AlarmBCallback(hdts, Sensor);
#endif /* USE_HAL_DTS_REGISTER_CALLBACKS */
  }
  /* Check if fault occurs */
  if ((interrupts & DTS_TS_ISR_IRQ_STATUS_FAULT) == DTS_TS_ISR_IRQ_STATUS_FAULT)
  {
    /* Clear corresponding flag */
    psensor->TS_ICR |= DTS_TS_ICR_IRQ_CLEAR_FAULT;

    /* Update error code */
    hdts->ErrorCode |= HAL_DTS_ERROR_FAULT;

    /* Call error callback */
#if (USE_HAL_DTS_REGISTER_CALLBACKS == 1)
    hdts->ErrorCallback(hdts, Sensor);
#else /* USE_HAL_DTS_REGISTER_CALLBACKS */
    HAL_DTS_ErrorCallback(hdts, Sensor);
#endif /* USE_HAL_DTS_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  DTS error callback.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @retval None.
  */
__weak void HAL_DTS_ErrorCallback(DTS_HandleTypeDef *hdts,
                                  HAL_DTS_Sensor     Sensor)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdts);
  UNUSED(Sensor);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_DTS_ErrorCallback could be implemented in the user file */
}

/**
  * @brief  Get current DTS handle state.
  * @param  hdts DTS handle.
  * @retval DTS state.
  */
HAL_DTS_StateTypeDef HAL_DTS_GetState(const DTS_HandleTypeDef *hdts)
{
  /* Return DTS state */
  return hdts->State;
}

/**
  * @brief  Get DTS error code.
  * @param  hdts DTS handle.
  * @retval DTS error code.
  */
uint32_t HAL_DTS_GetError(const DTS_HandleTypeDef *hdts)
{
  return hdts->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/

/** @addtogroup DTS_Private_Functions
  * @brief      Private functions
  * @{
  */

/**
  * @brief  Program SDA register.
  * @param  hdts DTS handle.
  * @param  Sensor Sensor.
  *         This parameter can be one of the following values:
  *           @arg @ref DTS_SENSOR_0 Sensor 0.
  *           @arg @ref DTS_SENSOR_1 Sensor 1.
  * @param  Reg SDA register to program.
  * @param  Value Value to program on SDA register.
  * @retval HAL status.
  */
static HAL_StatusTypeDef DTS_ProgramSdaRegister(DTS_HandleTypeDef *hdts, uint32_t Sensor,
                                                DTS_SdaRegisterTypeDef Reg, uint32_t Value)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  /* Check that serial data interface is not busy */
  while (((hdts->Instance->TSCSDIF_SR & DTS_TSCSDIF_SR_SDIF_BUSY) != 0U) && (status == HAL_OK))
  {
    if ((HAL_GetTick() - tickstart) > DTS_MAXIMUM_TIMEOUT)
    {
      status = HAL_TIMEOUT;
    }
  }

  if (status == HAL_OK)
  {
    if (Sensor == DTS_SENSOR_ALL)
    {
      hdts->Instance->TSCSDIF_CFGR = 0U;
    }
    else
    {
      /* Inhibit serial programming of other sensor */
      hdts->Instance->TSCSDIF_CFGR = (Sensor == (uint32_t) DTS_SENSOR_0) ? DTS_TSCSDIF_CFGR_SDIF_INHIBIT_1 :
                                     DTS_TSCSDIF_CFGR_SDIF_INHIBIT_0;
    }

    /* program value on SDA register using DTS_TSCSDIF_CR */
    hdts->Instance->TSCSDIF_CR = (DTS_TSCSDIF_CR_SDIF_PROG | DTS_TSCSDIF_CR_SDIF_WRN | (uint32_t) Reg | Value);
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Convert DTS sample to celsius degree.
  * @param  sample DTS sample.
  * @retval Temperature in celsius degree.
  */
static float_t DTS_ConvertToCelsiusDegree(uint32_t sample)
{
  float_t value;

  /* The temperature computation is Temp (celsius degree) = G + (H x Eqbs) + (J x Fclk_ts) */
  /* where Eqbs is equal to (sample/Cal5) - 0.5 */
  /* and Fclk_ts is 4MHz */

  /* Computation of Eqbs */
  value = ((((float_t) sample) / DTS_CAL5_PARAM) - 0.5f);

  /* Computation of temperature */
  value = DTS_G_PARAM + (DTS_H_PARAM * value) + (DTS_J_PARAM * 4.0f);

  /* Return temperature value */
  return value;
}

/**
  * @brief  Convert DTS sample from celsius degree.
  * @param  temperature Temperature in celsius degree.
  * @retval DTS sample.
  */
static uint32_t DTS_ConvertFromCelsiusDegree(float_t temperature)
{
  float_t value;

  /* The temperature computation is Temp (celsius degree) = G + (H x Eqbs) + (J x Fclk_ts) */
  /* where Eqbs = (sample/Cal5) - 0.5 */
  /* and Fclk_ts is 4MHz. */
  /* So we have sample = (Eqbs + 0.5) x Cal5 */
  /* and Eqbs = (Temp - G - (J x Fclk_ts)) / H. */

  /* Computation of Eqbs */
  value = (temperature - DTS_G_PARAM - (DTS_J_PARAM * 4.0f)) / DTS_H_PARAM;

  /* Computation of sample */
  value = (value + 0.5f) * DTS_CAL5_PARAM;

  /* Return sample value */
  return (uint32_t) value;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_DTS_MODULE_ENABLED */

/**
  * @}
  */
